[{"id":"rec17ZXYyDZOxVirD","createdTime":"2025-04-11T09:20:58.000Z","fields":{"Name":"Proof of brush","Description":"I call my idea proof of brush, 🖌️ Seeing so many AI generated Ghibli posts trending everywhere, I felt that artists like us, who try to create original work or immerse ourselves in creativity, our art can be easily copied and iterated by ai models, they would be pixel perfect and we definitely can't distinguish from original. I am not against advancements of technology, it's exciting as well as scary for creators, and artists. I want to explore this idea, solve the problem and build something around it. Maybe a solution for artists to sign their artwork and protect themselves from piracy.\n","Participants":["recln5TMt0DZ3CLck"],"Status":"Visible"}},{"id":"recHbeMaTsTC7EOti","createdTime":"2025-04-11T09:21:25.000Z","fields":{"Name":"ODD: on-chain donations directory","Description":"A public donation directory for on-chain donations with silent payments. The directory or one/more of its listings should be able to integrated into Contacts list of applications easily. The donation address should link to donation pages (or twitter) so users can verify the accuracy of the donation address if they wish to. Users should be able to add their donation address and other details (perhaps this can be done through a github repo and issues). Similar to btcpayserver's merchant directory in concept. \n","Participants":["recULe3CJkPCqTfDV"],"Status":"Visible"}},{"id":"recItmMHXTARzPK86","createdTime":"2025-04-22T09:49:55.000Z","fields":{"Name":"Decentralized Design","Description":"A marketplace to LICENSE bitcoin designs.\n\nThere are many great designers of Bitcoin merchandise. There are printers all around the world. \n\nIt doesn't make sense to pay DHL to ship your badass Bitcoin coffee mug from Thailand to Tanzania and pay customs on top.\n\nLicense the hi-res design to a local for sats. The can print locally and save a trip to DHL.\n","Status":"Visible"}},{"id":"recIx5SOUEmRPeI1l","createdTime":"2025-04-16T11:23:59.000Z","fields":{"Name":"No User Left Behind","Description":"Let’s build accessible Bitcoin tools—together.\n\nWe'll (we as in the team we gather) kick things off with a hands-on accessibility workshop where we sit down, explore real Bitcoin apps, and collaborate to make them easier to use—especially for people with disabilities, but ultimately for everyone.\n\nAs we test and improve these tools, we'll take notes, share insights, and collect best practices. The goal? To turn our learnings into a living, open-source resource: an Accessibility Guide for Bitcoin devs and designers.\n\nThis guide will be practical, easy to follow, and filled with real examples from the Bitcoin ecosystem—something anyone can use to design more inclusive and user-friendly apps from the start.\n\nIt’s about learning, doing, and documenting—together.\nexample: https://bitcoin.design/guide/designing-products/accessibility/\n\n### Why Accessibility Matters\n\nAccessibility ensures that everyone—regardless of physical ability, vision, hearing, cognitive challenges, or tech literacy—can use and benefit from the tools we build. In the Bitcoin and open-source world, we talk a lot about freedom, inclusion, and decentralization. But if our apps aren't usable by people with disabilities, we're unintentionally leaving a huge part of the global population behind.\n\nImproving accessibility isn't just the right thing to do—it also makes apps better for everyone. Thoughtful design leads to cleaner interfaces, better navigation, and more reliable interactions across all types of users.\n\nBy working on accessibility, we’re not just fixing bugs or adding features—we’re expanding the reach of Bitcoin and digital freedom to truly include everyone.\n\nAt last we can also make a website (Start with Accessibility) with helpful videos. For example like this: [https://startwithbitcoin.com/](https://startwithbitcoin.com/https://startwithbitcoin.com/)\n","Projects":["rec9ZaXgKajJGQ1HO"],"Project submissions":["recIcSKOsVWgnyAxv"],"Status":"Visible"}},{"id":"recLJXFRl1Zt65yOg","createdTime":"2025-04-16T11:24:02.000Z","fields":{"Name":"Bitcoin Safe","Description":"Looking for design improvements and ideas (not a complete redesign of the entire app) Bitcoin Safe.\n\nThe program can be downloaded and tested (with testnet) on: <https://bitcoin-safe.org>\n\nParticularly looking for design ideas for:\n- Onboarding (Bitcoin Safe includes a wallet setup wizard)\n- Category component in the address tab (can rename, drag to address, delete, add categories. Addresses can be dropped on categories)\n- Category selection in the send tab  (how to select a category to choose the coins from)\n\n\n","Status":"Visible"}},{"id":"recS6GT67AcgajQOc","createdTime":"2025-04-14T13:55:13.000Z","fields":{"Name":"Self-custody guidelines for organizations","Description":"This has been brought up in the Bitcoin Design Discord. As more organization (governments, companies, non-profits...) adopt bitcoin for their treasuries, many of them ideally do so in a self-custodial way. This is quite intricate and right now everyone has to come up with their own solution. Can we come up with best practices and guidelines to make that easier?\n\n- [Issue](https://github.com/BitcoinDesign/Guide/issues/1148)\n- [Discussion](https://discord.com/channels/903125802726596648/903126089512153088/1339375291897876541)\n","Status":"Visible"}},{"id":"recYJptInd6oJ9DeN","createdTime":"2025-04-11T09:21:28.000Z","fields":{"Name":"SplitSats - Social Bitcoin Adoption Through Shared Expenses","Description":"This idea leverages a common social situation (splitting dinner bills) to drive bitcoin adoption through:\n1. Creating practical utility for bitcoin wallets\n2. Providing social pressure/incentives for adoption\n3. Offering an immediate use case that benefits all parties\n\n### **Problem Statement:**\n\n- Current bill-splitting solutions (Venmo, Cash App, etc.) require KYC, centralized control, and fiat rails\n- Bitcoin adoption is hindered by lack of everyday use cases\n- New users need a compelling reason to download and use a bitcoin wallet\n\n## **Solution: SplitSats**\n\nA dedicated experience designed around bill-splitting with bitcoin that makes adoption frictionless:\n\n### **Easy Onboarding Flow**:\n- QR code at table connects everyone to a single bill-splitting session\n- Non-bitcoin users can join and be guided through wallet creation in seconds\n- Integrates with existing wallets for bitcoin users\n\n### **Social Elements**:\n- Gamification (group completes when everyone pays)\n- Achievement badges for first bitcoin transaction\n- Optional group photos/memories tied to the payment\n\n### **Incentives**:\n- Credit card payer gets traditional rewards (2-5%)\n- Bitcoin payers get privacy and self-sovereignty\n- First-time users get small welcome sats (sponsor funded)\n\n### **Implementation Options:**\n\n**Standalone App**: \"SplitSats\" as a dedicated application focusing solely on bill-splitting with bitcoin\n- Pros: Purpose-built UX, focused marketing\n- Cons: Another app to download\n\n**Wallet Integration**: Feature set that integrates into existing bitcoin wallets (Phoenix, Muun, etc.)\n- Pros: Leverages existing user base, improves wallet utility\n- Cons: Fragmented experience across wallets\n\n**Point-of-Sale Integration**: Partner with restaurant POS systems to offer bitcoin splitting natively\n- Pros: Most seamless experience, institutional adoption\n- Cons: Requires business partnerships, longer implementation timeline\n\nRelated project: [cowbolt.com](https://cowbolt.com/)\n","Status":"Visible"}},{"id":"recbPVzlUSGqmchRP","createdTime":"2025-04-14T13:55:14.000Z","fields":{"Name":"Let's explore Ark UX","Description":"Ark is a layer 2 that can complement bitcoin & lightning with convenient onboarding of new users. It is based on UTXO-sharing, and there are several teams working on implementations, making very good progress. Let's learn about this tech, discuss use cases and explore how it can be implemented in UIs.\n\n- <https://second.tech/>\n- <https://arkdev.info/>\n- <https://docs.spark.info/home/welcome>\n","Status":"Visible"}},{"id":"reclrnVkk9BqvAJHZ","createdTime":"2025-04-16T11:24:02.000Z","fields":{"Name":"Bitcoin Housie","Description":"🎉 Bitcoin Housie: A Game of Sats, Blocks, and Fun!\n\nBitcoin Housie is a fun, educational twist on the classic game of Tambola—where numbers are replaced with iconic Bitcoin terms, trivia, and memes or take words for the 2048 words random sheet (I have to think on it). It’ll be designed to help players learn about Bitcoin in an engaging, low-barrier way while having a great time.\n\nWhether you're a seasoned Bitcoiner or a total newbie, this game sparks curiosity, conversations, and laughs.\n","Status":"Visible"}},{"id":"recqGE1WtOB17UWEE","createdTime":"2025-04-09T10:27:30.000Z","fields":{"Name":"On-chain crowdfunding with silent payments","Description":"Financial freedom is a big part of freedom in general. But dependence on a single/couple of income sources can become a hurdle in the FOSS space.\n\nA donations feature set for an on-chain wallet using silent payments will help address this use-case. There is an opportunity to raise awareness about the power of silent payments in the community.\n","Participants":["recULe3CJkPCqTfDV"],"Status":"Visible"}},{"id":"recvo8pM1C1VP8Ca9","createdTime":"2025-04-11T09:21:28.000Z","fields":{"Name":"Zeus Redesign ","Description":"What it does: Mobile app to connect to your own Lightning node (e.g., LND, Core Lightning).\n\nNeeds redesign because: Functional but stark. Lightning flows are still scary for newbies.\n\nRedesign angle: Create a friendlier visual identity, more illustrative empty states, and educational microcopy to explain liquidity and channels.\n","Projects":["rec9ZaXgKajJGQ1HO"],"Participants":["recqu0up6K0FR68fP"],"Project submissions":["recIcSKOsVWgnyAxv"],"Status":"Visible"}}]