[{"id":"rec17ZXYyDZOxVirD","createdTime":"2025-04-11T09:20:58.000Z","fields":{"Name":"Proof of brush","Description":"I call my idea proof of brush, 🖌️ Seeing so many AI generated Ghibli posts trending everywhere, I felt that artists like us, who try to create original work or immerse ourselves in creativity, our art can be easily copied and iterated by ai models, they would be pixel perfect and we definitely can't distinguish from original. I am not against advancements of technology, it's exciting as well as scary for creators, and artists. I want to explore this idea, solve the problem and build something around it. Maybe a solution for artists to sign their artwork and protect themselves from piracy.\n","Participants":["recln5TMt0DZ3CLck"],"Status":"Visible"}},{"id":"recHbeMaTsTC7EOti","createdTime":"2025-04-11T09:21:25.000Z","fields":{"Name":"ODD: on-chain donations directory","Description":"A public donation directory for on-chain donations with silent payments. The directory or one/more of its listings should be able to integrated into Contacts list of applications easily. The donation address should link to donation pages (or twitter) so users can verify the accuracy of the donation address if they wish to. Users should be able to add their donation address and other details (perhaps this can be done through a github repo and issues). Similar to btcpayserver's merchant directory in concept. \n","Participants":["recULe3CJkPCqTfDV"],"Status":"Visible"}},{"id":"recYJptInd6oJ9DeN","createdTime":"2025-04-11T09:21:28.000Z","fields":{"Name":"SplitSats - Social Bitcoin Adoption Through Shared Expenses","Description":"This idea leverages a common social situation (splitting dinner bills) to drive bitcoin adoption through:\n1. Creating practical utility for bitcoin wallets\n2. Providing social pressure/incentives for adoption\n3. Offering an immediate use case that benefits all parties\n\n### **Problem Statement:**\n\n- Current bill-splitting solutions (Venmo, Cash App, etc.) require KYC, centralized control, and fiat rails\n- Bitcoin adoption is hindered by lack of everyday use cases\n- New users need a compelling reason to download and use a bitcoin wallet\n\n## **Solution: SplitSats**\n\nA dedicated experience designed around bill-splitting with bitcoin that makes adoption frictionless:\n\n### **Easy Onboarding Flow**:\n- QR code at table connects everyone to a single bill-splitting session\n- Non-bitcoin users can join and be guided through wallet creation in seconds\n- Integrates with existing wallets for bitcoin users\n\n### **Social Elements**:\n- Gamification (group completes when everyone pays)\n- Achievement badges for first bitcoin transaction\n- Optional group photos/memories tied to the payment\n\n### **Incentives**:\n- Credit card payer gets traditional rewards (2-5%)\n- Bitcoin payers get privacy and self-sovereignty\n- First-time users get small welcome sats (sponsor funded)\n\n### **Implementation Options:**\n\n**Standalone App**: \"SplitSats\" as a dedicated application focusing solely on bill-splitting with bitcoin\n- Pros: Purpose-built UX, focused marketing\n- Cons: Another app to download\n\n**Wallet Integration**: Feature set that integrates into existing bitcoin wallets (Phoenix, Muun, etc.)\n- Pros: Leverages existing user base, improves wallet utility\n- Cons: Fragmented experience across wallets\n\n**Point-of-Sale Integration**: Partner with restaurant POS systems to offer bitcoin splitting natively\n- Pros: Most seamless experience, institutional adoption\n- Cons: Requires business partnerships, longer implementation timeline\n\nRelated project: [cowbolt.com](https://cowbolt.com/)\n","Status":"Visible"}},{"id":"recqGE1WtOB17UWEE","createdTime":"2025-04-09T10:27:30.000Z","fields":{"Name":"On-chain crowdfunding with silent payments","Description":"Financial freedom is a big part of freedom in general. But dependence on a single/couple of income sources can become a hurdle in the FOSS space.\n\nA donations feature set for an on-chain wallet using silent payments will help address this use-case. There is an opportunity to raise awareness about the power of silent payments in the community.\n","Participants":["recULe3CJkPCqTfDV"],"Status":"Visible"}},{"id":"recvo8pM1C1VP8Ca9","createdTime":"2025-04-11T09:21:28.000Z","fields":{"Name":"Zeus Redesign ","Description":"What it does: Mobile app to connect to your own Lightning node (e.g., LND, Core Lightning).\n\nNeeds redesign because: Functional but stark. Lightning flows are still scary for newbies.\n\nRedesign angle: Create a friendlier visual identity, more illustrative empty states, and educational microcopy to explain liquidity and channels.\n","Participants":["recqu0up6K0FR68fP"],"Status":"Visible"}}]