[{"id":"rec5sCcfBuyEYCM5N","createdTime":"2025-05-09T05:24:03.000Z","fields":{"Name":"Everyday Bitcoin","Description":"Bitcoin feels intimidating and exclusive—like it’s only for investors or the tech-savvy. Everyday people who are new to the idea often hesitate to try it due to fear, unrecognizable jargon, or simply not seeing themselves in the “crypto culture”. I'd like to explore a solution through a hands-on simulator where users experiment with fake Bitcoin in a wallet (send, receive, save), paired with a \"Everyday Bitcoin\" ad campaign that showcases “ordinary” people using bitcoin in everyday situations.\n\nI originally wanted to explore this as a solo project, but if anyone is reading this and would like to help out, please feel free to reach out to me on discord. Username: ococolo","Participants":["recPnePL1KRUVBBJp","recRHszA1v4PNTvYv"],"Status":"Visible"}},{"id":"rec6rRt4wlxkUzKtF","createdTime":"2025-05-01T13:53:18.000Z","fields":{"Name":"BittyFun","Description":"BittyFun is an engaging platform designed to introduce newcomers to Bitcoin through interactive, enjoyable learning experiences rather than technical documentation or complex coding concepts. The platform breaks down Bitcoin fundamentals such as bitcoin basics and history, how transaction works, wallet and security, etc into accessible, bite-sized lessons with visual explanations to keep learners motivated and entertained.\n\n- Project Discord channel: https://discord.gg/Gbv8S6dW\n- Walkthrough: https://drive.google.com/file/d/1fIbti52he1Ppvxahdo3Sl1hz2Tgmp3d7/view?usp=sharing","Participants":["receonXdtUPro2jrG","rec5HWDc1NJbmGA50","rec3FaLIlB4KP0ZUi","recKOzXsbCvyWafX2","recGHV2MueqbOOw50"],"Status":"Visible","Final Project Submission":["rec1o93MiVORYx8Qv"]}},{"id":"recASTiNHJU8MN6ne","createdTime":"2025-05-05T10:49:08.000Z","fields":{"Name":"Bitcoin Bonsai / Beacon","Description":"Goal: To create and distribute a Bitcoin Bonsai (Price Tracker, Desktop Widget) to raise funds for the Bitcoin Beacon (Table-Top Lamp).\n\n**Bitcoin Bonsai [Desktop Widget]:** This will be part of the Designathon. Everyone taking part will get the widget for free.\n\n**Bitcoin Beacon (Not Part of the Designathon Timeline):**\nGoal is to use raised funds to prototype, test, and manufacture the ambient Bitcoin lamp.\n\nThis will be optional for anyone who makes significant contributions to the Desktop Widget. \n\n- Work doc: https://docs.google.com/presentation/d/1sTq03dnGk6ogEmMGS_p-iRR-IGC9mGmRcxR4V0_7uvs/edit#slide=id.g3540473645e_0_0\n- Presentation: https://www.youtube.com/watch?v=OIEbrxFUMmk&t=415s\n","Participants":["recWpviOX2ChMPMfJ"],"Status":"Visible","Final Project Submission":["recIOZ00gpRtiR7Sj"]}},{"id":"recFWLCF7sUO3YQrs","createdTime":"2025-05-13T06:55:20.000Z","fields":{"Name":"Bitcoin Housie","Description":"Bitcoin Housie: A Game of Sats, Blocks, and Fun!\n\nBitcoin Housie is a fun, educational twist on the classic game of Tambola—where numbers are replaced with iconic Bitcoin terms, trivia, and memes or take words for the 2048 words random sheet (I have to think on it). It’ll be designed to help players learn about Bitcoin in an engaging, low-barrier way while having a great time.\n\nWhether you're a seasoned Bitcoiner or a total newbie, this game sparks curiosity, conversations, and laughs.\n\nHere is a doc i have made :- https://docs.google.com/document/d/1H1nHxbVpxnJQ9HEVZqeP2bj-zr9Mo_ABkwlsp4YX_yI/edit?tab=t.ys7lswlg2xcc#heading=h.ax6nne6ncf9t \n\nI'm now working on a graphic side of it now like packaging and how it'll look.\n\n- Presentation: https://www.youtube.com/watch?v=OIEbrxFUMmk&t=2070s\n- Walkthrough: https://www.loom.com/share/a52c96a8bd62440d9d1db9c0f9a5ad2d?sid=5c09cd2b-faf1-45e1-98a1-714f5ebd6475","Participants":["recpEDU9KTCSt1FYG"],"Status":"Visible","Final Project Submission":["recAAhcDWeoFuoMjU"]}},{"id":"recI9sFaMBiPJykOF","createdTime":"2025-05-04T07:47:45.000Z","fields":{"Name":"Dive into NWC","Description":"In the coming months and years, I expect we will see a tidal wave of new apps/products/experiences that take advantage of moving value permissionlessly across borders. New social networks, new games, new things we can’t imagine. Experiences that are made better with Bitcoin. \n\nYet I don’t think we want or expect each app/experience to have its own wallet. \n\nThe best experience will be to allow the user to “bring their wallet” (ie connect their wallet, ideally self-custodial) to the app, appropriately permissioned, and simply have the bitcoin flow as needed. \n\nAs far as I can tell, Nostr Wallet Connect (NWC) is the leading protocol to facilitate this, with Alby Hub being one of the first wallets to support this kind of cross-app connectivity. It’s already quite a great experience!\n\nBut think it would be valuable to bring a design lens to the user problem of cross-app wallet connectivity to study it more closely. \n\n1. We can investigate NWC (as well as any leading alternatives if they exist) and develop some design material to help educate others about the possibilities it unlocks \n\n2. We can examine Alby’s implementation and look for ways to optimize it the UX\n\n3. We can generalize and imagine the best-possible UX (either custodial or non-custodial) and share any concrete ideas for improving the NWC protocol or the way future apps/products and wallets make use of it\n\nIt will be fun to dig into NWC and explore all the possibilities it unlocks.\n\nLinks:\n- https://nwc.dev/\n- https://www.getalby.com/\n\nJoin the project Discord channel here: https://discord.gg/Qv9qHpWdD5","Participants":["recxG65oXl36E9NLW","recEsx1WXkCFplHri"],"Status":"Visible"}},{"id":"recIcQX1I54OGWq10","createdTime":"2025-05-13T06:55:22.000Z","fields":{"Name":"Just another Ecash nutsnote","Description":"Just another Ecash nutsnote design for brrr.gandlaf.com tool, honoring its ideator David Chaum. Despite the turn the initial project took, we would not have Ecash today without his pioneering approach in cryptography and privacy-preserving technologies.\n\nA simple KISS (Keep It Super Simple) Ecash nutsnote delivered as SVG, nothing fancy, designed in PenPot: \n\nhttps://design.penpot.app/#/view?file-id=749aaa04-8836-81c6-8006-0b29916ec156&page-id=749aaa04-8836-81c6-8006-0b29916ec157&section=interactions&index=0&share-id=addba4d5-28a4-8022-8006-2ecc4316ebb2\n\nIt will use a simplified version of the current brrr template.\n\nIf any time left, I'll also try to submit the svelte file to the repo for easier implementation. Feedback as comments in the PenPot file are more than welcome.","Participants":["rec9l1FudKrHzNzVE"],"Status":"Visible","Prize":"ecash-1","Final Project Submission":["rec0B3kygtiAlfk3q"]}},{"id":"recOhd18VB9SrCdtU","createdTime":"2025-05-04T14:05:54.000Z","fields":{"Name":" Bitcoin A11y Kit","Description":"The Bitcoin A11y Kit is an open-source accessibility toolkit designed specifically for Bitcoin wallets and applications. Its goal is to make it easy for developers and designers to build interfaces that are accessible to everyone-including people with visual, motor, or cognitive disabilities.\n\nI want to bridge the gap between accessibility guidelines and real-world implementation in the Bitcoin ecosystem. The kit will provide:\n\n- A standardized accessibility menu component (font size, color contrast, reduced motion, etc.)\n- Ready-to-use, Bitcoin-specific, accessible UI components (transaction lists, wallet addresses, QR code alternatives, seed phrase flows)\n- Implementation guides and code samples (HTML, CSS, ARIA)\n- Documentation and Figma assets for designers\n- Best practices for screen reader compatibility, keyboard navigation, and alt text\n\nI plan to research accessibility pain points in existing Bitcoin wallets, design and prototype the most important flows, and create reusable assets and documentation. The kit will be open for collaboration-designers, developers, and accessibility advocates are welcome!\n\nResources:\n- https://bitcoin.design/guide/designing-products/accessibility/\n- https://m2.material.io/design/usability/accessibility.html#understanding-accessibility\n- https://www.w3.org/TR/WCAG22/\n\nLet's make Bitcoin accessible for everyone 🌍!","Participants":["recapoTEjFWsoh7sH"],"Status":"Visible"}},{"id":"recT0XRRaXStyiIIp","createdTime":"2025-04-29T07:30:48.000Z","fields":{"Name":"Proof of Brush","Idea":["rec17ZXYyDZOxVirD"],"Description":"I want to achieve 3 things, firstly, I want to create a portal for artists to upload their signatures and view their artworks. Secondly, a portal for viewers or buyers to be able to verify the artworks, a verification tool, mostly. Thirdly, this requires a lot of research, I would like to see if I can design a new protocol named \"Proof of Brush\" to protect the artist from plagiarism by any human or even an AI. The problem statement is close to my heart because I am an artist, and this is a product for me and all other artists like me.\n\nRead: The methods we have used in the past, like NFT Marketplaces, C2PA / Content Authenticity Initiative, Spawning / \"Have I Been Trained?\", etc.\n\nYou can also read on how to create a protocol by anchoring on Bitcoin. Anything related to the ideas or exploration of the idea may help. \n\nJoin the Telegram: https://t.me/+o2AWMR0Cjm0wZTdl","Participants":["recJPnrWwrfUCxfWA","recUVFGP0jS0lDbHa","rec9WOojv1jLr1YJG","recapoTEjFWsoh7sH","rec5HWDc1NJbmGA50","rec3FaLIlB4KP0ZUi"],"Status":"Visible"}},{"id":"recTHi47ueo8k4tYc","createdTime":"2025-05-12T06:23:23.000Z","fields":{"Name":"Bitcoin Project Cards","Description":"Bitcoin Core has been having a rough couple of weeks, with lots of social media drama swirling—much of it based on misinformation.\n\nI'd like to explore ways the design community might help give bitcoin core projects more visibility, understanding and love. \n\nThis particular project will explore the idea of developing fun \"pokemon style\" cards that succinctly represent each project, highlight the dimension(s) along which they contribute most significantly (Strength: Privacy) in a fun & visual way. May also think about how a project card can be thought of being \"evolved\" into more powerful versions. \n\nMy plan for this project will be to use a small handful of bitcoin core projects that are currently in flight (referring to recent bitcoin optech newsletters as source material) and develop one or more prototype card \"styles\" (with some help from AI) to see if there is something interesting here. An small, fun experiment. ","Participants":["recxG65oXl36E9NLW","recGHfCjcpwZBnwwr","recDKpq4QzMhp6sy1"],"Status":"Visible"}},{"id":"recTaQmV1nRxcBhId","createdTime":"2025-05-04T08:33:47.000Z","fields":{"Name":"bit4kid","Idea":["recMbtUjEeYPyzI3O"],"Description":"The goal of the project is to create a Bitcoin wallet for kids that helps them learn financial responsibility while receiving allowance from parents in a safe and fun way. We want to build a working prototype or high-fidelity design that shows how children can manage Bitcoin in “Save,” “Spend,” and “Give” buckets, complete small quests to earn sats, and receive Lightning-powered payments from parents.\n\nThis is a solo project and is not looking for contributors.\n\nMore info is here: https://docs.google.com/document/d/1pO4xq9lXcJlCZg9Z6qqLZJJvlI9KuhoKJ3XZJM1VdfM/edit?usp=sharing","Participants":["recffUBKe3Jm8R8Ll","reclRV3Qzp6FEaGbM"],"Status":"Visible"}},{"id":"recX6nq4Ok7JItMOP","createdTime":"2025-04-23T08:12:30.000Z","fields":{"Name":"Ecash Designs","Description":"Creating graphic and web media art designs for Nostr & Ecash projects. Character designs (NUTs, Wizards, Aliens etc) to use as fun mascot and logo's project branding desigins for (new) Ecash projects. I believe a lot new Ecash projects need proper design and this is what I will deliver. \n\nAsit, one of the participants that submitted under this project, won third price for this design. See his presentation here: https://www.youtube.com/watch?v=OIEbrxFUMmk&t=3370s","Participants":["recOS5WdKDqXLkA4u","recoNGLvYSWb9OV6H","rec7TVO9BTFvJD6Jo","recUVFGP0jS0lDbHa","recoYxibsKeluJJ6j","recI3aE8Cm7Po4nN9"],"Status":"Visible","Final Project Submission":["recTcUbwHbzI8hGdc"]}},{"id":"reca0pE2dNmvK7Lal","createdTime":"2025-05-05T12:54:52.000Z","fields":{"Name":"BOLT 12 Subscriptions for Podcasters","Description":"There is a proposal to bring back subscriptions to the BOLT 12 spec! This project will explore what a podcasting app would look like if fans could \"subscribe\" to their favorite podcasters using BOLT 12 and support creators with recurring payments.\n\n- Project Discord channel: https://discord.gg/YxQ9uFjqud\n- Presentation: https://www.youtube.com/watch?v=IZEZ8a1mekQ&t=390s\n- Walkthrough: https://drive.google.com/file/d/1UEx4PzL1FI3CDKO5hPX9ph_8RUiNhsON/view?usp=sharing","Participants":["recEWX86lMsYBkfqn"],"Status":"Visible","Prize":"1","Final Project Submission":["rect8BkCoUCbvwfLg"]}},{"id":"reccMViMFijPPUSY1","createdTime":"2025-05-12T06:02:54.000Z","fields":{"Name":"Ecash Notes","Description":"Designing a template for a printable Ecash note for brrr.gandlaf.com, a tool that lets anyone generate printable Ecash in the style of traditional bank notes.","Participants":["rec5I9CZEQaNC0qKF","recR82Z8Iby64Z2fs","recUFMw9IxYmGRVHv"],"Status":"Visible","Prize":"ecash-3"}},{"id":"recg4gPk7WQhb7dm7","createdTime":"2025-04-30T09:59:22.000Z","fields":{"Name":"BitTerms","Description":"BitTerms is a simple, user-friendly glossary that helps people understand Bitcoin through clear, visual explanations. As Bitcoin becomes more relevant, its complex language still keeps many people out. BitTerms makes learning easy and accessible for everyone, no matter their background.\n\nI have some team members but collaborators won't be bad, especially illustrators.\n \nHere is a google doc that contains more info:\nhttps://docs.google.com/document/d/1__M15ZFIfxpJ-7ABUn4sRDdznEF5zKe2i2xwpwE3CX8/edit?usp=sharing\n\n- Project Discord channel: https://discord.gg/ekuYwmaY4a\n- Presentation: https://www.youtube.com/watch?v=IZEZ8a1mekQ&t=2060s\n- Walkthrough: https://www.loom.com/share/1e45b32c797f4a92be68b286436c1e3c?sid=40211388-45ae-45a8-bfce-dfcd15c25dbb","Participants":["rec5I9CZEQaNC0qKF","recufnDkt8rxupICX","recGOnBNhquY08czv","recWAoxn8Bw7kqHzt"],"Status":"Visible","Prize":"6","Final Project Submission":["rec11c8BxZMR7att3"]}},{"id":"recj4SVNLLkuWHpKq","createdTime":"2025-05-03T13:29:25.000Z","fields":{"Name":"SafeBits","Idea":["recIx5SOUEmRPeI1l","recLJXFRl1Zt65yOg","recS6GT67AcgajQOc"],"Description":"The journey of onboarding a user and create a multiSig setup begins far before opening a desktop like Bitcoin Safe (https://bitcoin-safe.org/) or any other similar application.\n\nBitcoin Safe seems designed for families and people that want to start exploring and learning about multiSig setup. The need for such application of bitcoin could go much further defining best practices for private organizations that aim to custody bitcoin in a private and anonymous way, following and enjoy the values and standards bitcoin has been built for.\n\nOrganizations and small private groups like families, family offices and solopreneurs operating on a bitcoin standard will have the need to keep track of transactions and categorize them to keep the books in order. A part of our efforts will be spent ensuring accessibility standards are in place for everyone to use Bitcoin Safe with comfort and safety.\n\nWe aim with this project to bring together the three ideas below:\n- Bitcoin Safe\n- No User Left Behind\n- Self-custody guidelines for organizations\n\n**Links**\n- Project chat: https://discord.gg/qczkfabEfz\n- Project website: https://safe.btc.pub/\n- Presentation: https://www.youtube.com/watch?v=IZEZ8a1mekQ&t=1260s","Participants":["rec9l1FudKrHzNzVE","recxop77tU5z6B3v9"],"Status":"Visible","Prize":"accessibility,open-design","Final Project Submission":["recb8ZtpA7iLUYc2G"]}},{"id":"reclGO76RLWFzQhxe","createdTime":"2025-05-12T10:36:58.000Z","fields":{"Name":"Bitcoin GenZ-ines","Description":"Printable zines featuring\n1. a series of configurable characters that depict the evolution of money throughout history\n2. pixel-art portraits of popular bitcoiner personalities\n\nBasically educative bitcoin content for GenZ in the form of zines!","Participants":["recF0a3zBH36b2kKN"],"Status":"Visible"}},{"id":"reclGPgryqIlUtEYJ","createdTime":"2025-05-09T05:24:36.000Z","fields":{"Name":"BitPass","Description":"BitPass is a Bitcoin-native ticketing platform that empowers event organizers to create, sell, and manage tickets using Lightning Network payments and Nostr technology.\n\n- Github: https://github.com/bitpass-live\n- Presentation: https://www.youtube.com/watch?v=IZEZ8a1mekQ&t=3990s","Participants":["recD7Dq4E9HNOdOa1"],"Status":"Visible","Prize":"2","Final Project Submission":["recWhwyHuAJGmqCc8"]}},{"id":"recr87B79yGKy4ZRC","createdTime":"2025-05-06T06:35:17.000Z","fields":{"Name":"Redesigning Zeus Mobile App","Idea":["recvo8pM1C1VP8Ca9"],"Description":"- Figma File: https://www.figma.com/design/dXXCGdZKTlzZUkIdsyEWtD/Resigning-Zeus-Mobile-App?node-id=0-1&t=Fc2CjqNyf0L1wwqt-1\n- Google Docs: https://docs.google.com/document/d/1GUYp2YvElHM9r9ggwfa3qFSZjiRkJd6HJ4M2TDp_Ne8/edit?usp=sharing\n- Project Discord channel: https://discord.gg/rAsnHnXQDd\n- Presentation: https://www.youtube.com/watch?v=OIEbrxFUMmk&t=1162s\n- Walkthrough: https://www.loom.com/share/f774593ace1f4f69816be6af0367c87c","Participants":["recOcJ9WWdIQwWtsT","recLUl8Wp2X6lBOdC","recYPwJs3HKKmnshM","recxwd6iQTDuImvwx","recRGScehoa5tpg5Q"],"Status":"Visible","Prize":"4","Final Project Submission":["rechRoDjoRWHrGFsF","recTSVhz7oByz7xOP"]}},{"id":"rectd6u1Clz9PP0rr","createdTime":"2025-05-05T14:14:07.000Z","fields":{"Name":"Bitcoin Beauty School","Description":"Bitcoin Beauty School is an educational platform focused on women who are beginners in Bitcoin, using beauty language (skincare, makeup, hair) to teach the key concepts in a fun, visual, and non-technical way.\n\nThe idea is to create a quiz/game experience (like Buzzfeed) where each answer reveals a Bitcoin concept through accessible analogies. The final result shows your crypto beauty profile with gentle explanations (and an optional technical version if you want to dive deeper).\n\nThis is a solo project and is not looking for contributors.\n\n- Google Doc: https://docs.google.com/document/d/1rZgKaoHHVPLiy8tC0oc4TgkLX3lFueU5rp-QAhF8mFc/edit?usp=sharing\n- Presentation: https://drive.google.com/drive/folders/1sC9usdCuV5H--BKQWt2NZs6tsujBbllt?usp=sharing","Participants":["recyWAZlAoUl6suYD","recOnBFfLi5dGRvW0","recymBo9gUPdfTlIn"],"Status":"Visible","Final Project Submission":["recVHgkZiAijloERy"]}},{"id":"recxaJTb2FZrUdg3c","createdTime":"2025-05-13T06:55:22.000Z","fields":{"Name":"Sovereign Note","Description":"A fun, personal, and cultural experience project. designing beautiful eCash note.  Some use cases like event scratch lotteries, snack and drink tokens, and digital wedding gifts (Shagun) — blending tradition with technology. Each note can carry a memory, a moment, or a message, making it more than just money — it’s a souvenir, a story, and a step toward making digital cash more human, inclusive, and memorable.\n\n- Here is the doc I'm working on : https://docs.google.com/document/d/15AFuse3PU1bmJh31doLkYa_H6so_PvX68JSiTzKDVLE/edit?tab=t.0\n- Presentation: https://www.youtube.com/watch?v=OIEbrxFUMmk&t=2675s\n- Walkthrough: https://www.loom.com/share/5739cee909b04bbe9a660fe9df05dd11?sid=4e747fc1-0e2f-4af4-9df2-73a3bebfb901","Participants":["recpEDU9KTCSt1FYG"],"Status":"Visible","Prize":"3,ecash-2,ecash-c","Final Project Submission":["rectfXZLrkVOwfggH"]}},{"id":"recxdo2cUCzHoY7oH","createdTime":"2025-05-03T11:52:04.000Z","fields":{"Name":"BitAble","Idea":["recIx5SOUEmRPeI1l"],"Description":"I’m designing an accessible Bitcoin wallet experience that simplifies self-custody for people with disabilities. By focusing on usability, clarity, and inclusion, the goal is to make Bitcoin truly usable for everyone, no matter their ability. This project aligns with the ethos of “Design Bitcoin for Everyone” and challenges the assumption that Bitcoin is only for the tech-savvy. Everyone deserves financial sovereignty, and design can open the door.\n\nYes! I’m looking for collaborators with expertise in accessibility testing, UI/UX design, and Bitcoin development to help create an intuitive and inclusive experience. Together, we can ensure this wallet empowers users from all walks of life to access Bitcoin freely and securely.\n\n- Project Discord channel: https://discord.gg/D2hvKQaRjY\n- Presentation: https://www.youtube.com/watch?v=IZEZ8a1mekQ&t=2915s\n- Walkthrough: https://www.loom.com/share/05b52c6aa09d46baaefec64f9d8d5da4?sid=d0714d3e-0674-4087-956e-72e73abe4e52","Participants":["recBfh8BvQc2czMnB","recnEPHbo1AaiUM5N","recofJvUKOWEKTyos","recymBo9gUPdfTlIn","recUQAvcJXMPYj6qR"],"Status":"Visible","Prize":"5","Final Project Submission":["recFE6KvztmYmf6tL"]}},{"id":"reczoE4WXQpKW5pZA","createdTime":"2025-05-03T05:36:33.000Z","fields":{"Name":"Re-basing Bitcoin","Description":"This project will attempt to exhaustively examine the design implications of John Carvalho’s BIP177, which suggests doing away with “satoshis” (or sats) as user-facing language and defining “bitcoin” to mean the smallest unit. \n\nThe project will adopt a position of favorably advocating for this change and will aim to create design collateral that will (1) help illustrate the benefits and (2) contribute to influencing consensus in this direction. \n\nWith thanks to Yashr@j some deliverables that can be considered as part of this project:\n\n- proposing the “best name” for the change\n- FAQ\n- Visuals / explainers\n- website and/or twitter presence \n- BCAP review\n- quick prototypes\n- mockup changes in real products \n- user stories \n- more to be brainstormed!\n\nAdditional info:\n\nBIP177\nhttps://github.com/bitcoin/bips/pull/1821\n\nPBJ podcast:\nhttps://www.youtube.com/watch?v=F6X03efgJww&t=100s\n\nSome of my thoughts on the matter:\nhttps://discord.com/channels/903125802726596648/1365135691696046161/1366117729274167447\n\nJoin the project Discord channel: https://discord.gg/y5YE8tN5RA","Participants":["recxG65oXl36E9NLW","recwKd0kMwML8HZw4"],"Status":"Visible"}}]